<?php

use Illuminate\Database\Seeder;

class GenresTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     * 楽天のジャンル一覧APIを元にしているため、固定IDになっている。(ID14のみスキップされている特殊な並び)
     *
     * @return void
     */
    public function run()
    {
        DB::table('genres')->insert([
            ['id' => 1, 'name' => '漫画'],
            ['id' => 2, 'name' => '語学・学習参考書'],
            ['id' => 3,  'name' => '絵本・児童書・図鑑'],
            ['id' => 4,  'name' => '小説・エッセイ'],
            ['id' => 5,  'name' => 'パソコン・システム開発'],
            ['id' => 6,  'name' => 'ビジネス・経済・就職'],
            ['id' => 7,  'name' => '旅行・留学・アウトドア'],
            ['id' => 8,  'name' => '人文・思想・社会'],
            ['id' => 9,  'name' => 'ホビー・スポーツ・美術'],
            ['id' => 10,  'name' => '美容・暮らし・健康・料理'],
            ['id' => 11,  'name' => 'エンタメ・ゲーム'],
            ['id' => 12,  'name' => '科学・技術'],
            ['id' => 13,  'name' => '写真集・タレント'],
            // MEMO:楽天レスポンスのid調整のためにID14をスキップ。唱えてはいけない滅びの呪文。
            ['id' => 15,  'name' => 'その他'],
            ['id' => 16,  'name' => '資格・検定'],
            ['id' => 17,  'name' => 'ライトノベル'],
            ['id' => 18,  'name' => '楽譜'],
            ['id' => 19,  'name' => '文庫'],
            ['id' => 20,  'name' => '新書'],
            ['id' => 21,  'name' => 'ボーイズラブ（BL）'],
            ['id' => 22,  'name' => '付録付き'],
            ['id' => 23,  'name' => 'バーゲン本'],
            ['id' => 24,  'name' => 'コミックセット'],
            ['id' => 25,  'name' => 'カレンダー・手帳・家計簿'],
            ['id' => 26,  'name' => '文具・雑貨'],
            ['id' => 27,  'name' => '医学・薬学・看護学・歯科学'],
        ]);
    }
}
