import React, { Component } from 'react';

export class TermsOfServiceView extends Component {
    componentDidMount() {
        document.getElementById('top').scrollIntoView();
    }

    render() {
        return (
            <div id="top" className="container policy-wrapper mt-5">
                <div className="policy-frame policy-content">
                    <h1>BookBok利用規約</h1>
                    <p>
                        この利用規約（以下，「本規約」といいます。）は，BookBok運営チーム（以下，「運営チーム」といいます。）がこのウェブサイト上で提供するサービス（以下，「本サービス」といいます。）の利用条件を定めるものです。登録ユーザーの皆さま（以下，「ユーザー」といいます。）には，本規約に従って，本サービスをご利用いただきます。
                    </p>

                    <h2 className="mt-5">第1条（適用）</h2>
                    <p>
                        本規約は，ユーザーと運営チームとの間の本サービスの利用に関わる一切の関係に適用されるものとします。
                    </p>

                    <h2 className="mt-5">第2条（利用登録）</h2>
                    <ol>
                        <li>
                            登録希望者が運営チームの定める方法によって利用登録を申請し，運営チームがこれを承認することによって，利用登録が完了するものとします。
                        </li>
                        <li>
                            運営チームは，利用登録の申請者に以下の事由があると判断した場合，利用登録の申請を承認しないことがあり，その理由については一切の開示義務を負わないものとします。
                            <ol>
                                <li>利用登録の申請に際して虚偽の事項を届け出た場合</li>
                                <li>本規約に違反したことがある者からの申請である場合</li>
                                <li>
                                    未成年者，成年被後見人，被保佐人または被補助人のいずれかであり，法定代理人，後見人，保佐人または補助人の同意等を得ていなかった場合
                                </li>
                                <li>
                                    反社会的勢力等（暴力団，暴力団員，右翼団体，反社会的勢力，その他これに準ずる者を意味します。）である，または資金提供その他を通じて反社会的勢力等の維持，運営もしくは経営に協力もしくは関与する等反社会的勢力との何らかの交流もしくは関与を行っていると運営チームが判断した場合
                                </li>
                                <li>その他，運営チームが利用登録を相当でないと判断した場合</li>
                            </ol>
                        </li>
                    </ol>

                    <h2 className="mt-5">第3条（アカウントの管理）</h2>
                    <ol>
                        <li>
                            利用者は、利用に際して登録した情報（以下、「登録情報」といいます。メールアドレスやID・パスワード等を含みます）について、自己の責任の下、任意に登録、管理するものとします。利用者は、これを第三者に利用させ、または貸与、譲渡、名義変更、売買などをしてはならないものとします。
                        </li>
                        <li>
                            運営チームは、登録情報によって本サービスの利用があった場合、利用登録をおこなった本人が利用したものと扱うことができ、当該利用によって生じた結果ならびにそれに伴う一切の責任については、利用登録を行った本人に帰属するものとします。
                        </li>
                    </ol>

                    <h2 className="mt-5">第4条（個人情報の取り扱い）</h2>
                    <p>
                        個人情報及び利用者情報については、運営チームが別途定める「
                        <a href="{{ route('home.privacy') }}">プライバシーポリシー</a>
                        」に則り、適正に取り扱うこととします。
                    </p>

                    <h2 className="mt-5">第5条（広告の掲載について）</h2>
                    <p>
                        利用者は、本サービス上にあらゆる広告が含まれる場合があること、運営チームまたはその提携先があらゆる広告を掲載する場合があることを理解しこれを承諾したものとみなします。本サービス上の広告の形態や範囲は、運営チームによって随時変更されます。
                    </p>

                    <h2 className="mt-5">第6条（利用料金および支払方法）</h2>
                    <ol>
                        <li>
                            ユーザーは，本サービス利用の対価として，運営チームが別途定め，本ウェブサイトに表示する利用料金を，運営チームが指定する方法により支払うものとします。
                        </li>
                        <li>
                            ユーザーが利用料金の支払を遅滞した場合には，ユーザーは年14．6％の割合による遅延損害金を支払うものとします。
                        </li>
                    </ol>

                    <h2 className="mt-5">第7条（禁止事項）</h2>
                    <div>
                        ユーザーは，本サービスの利用にあたり，以下の行為をしてはなりません。
                        <ol>
                            <li>法令または公序良俗に違反する行為</li>
                            <li>犯罪行為に関連する行為</li>
                            <li>
                                運営チームのサーバーまたはネットワークの機能を破壊したり，妨害したりする行為
                            </li>
                            <li>運営チームのサービスの運営を妨害するおそれのある行為</li>
                            <li>他のユーザーに関する個人情報等を収集または蓄積する行為</li>
                            <li>他のユーザーに成りすます行為</li>
                            <li>
                                運営チームのサービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為
                            </li>
                            <li>
                                運営チーム，本サービスの他の利用者または第三者の知的財産権，肖像権，プライバシー，名誉その他の権利または利益を侵害する行為
                            </li>
                            <li>
                                過度に暴力的な表現，露骨な性的表現，人種，国籍，信条，性別，社会的身分，門地等による差別につながる表現，自殺，自傷行為，薬物乱用を誘引または助長する表現，その他反社会的な内容を含み他人に不快感を与える表現を，投稿または送信する行為
                            </li>
                            <li>
                                営業，宣伝，広告，勧誘，その他営利を目的とする行為（運営チームの認めたものを除きます。），性行為やわいせつな行為を目的とする行為，面識のない異性との出会いや交際を目的とする行為，他のお客様に対する嫌がらせや誹謗中傷を目的とする行為，その他本サービスが予定している利用目的と異なる目的で本サービスを利用する行為
                            </li>
                            <li>宗教活動または宗教団体への勧誘行為</li>
                            <li>その他，運営チームが不適切と判断する行為</li>
                        </ol>
                    </div>

                    <h2 className="mt-5">第8条（本サービスの提供の停止等）</h2>
                    <ol>
                        <li>
                            運営チームは，以下のいずれかの事由があると判断した場合，ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
                            <ol>
                                <li>
                                    本サービスにかかるコンピュータシステムの保守点検または更新を行う場合
                                </li>
                                <li>
                                    地震，落雷，火災，停電または天災などの不可抗力により，本サービスの提供が困難となった場合
                                </li>
                                <li>コンピュータまたは通信回線等が事故により停止した場合</li>
                                <li>その他，運営チームが本サービスの提供が困難と判断した場合</li>
                            </ol>
                        </li>
                        <li>
                            運営チームは，本サービスの提供の停止または中断により，ユーザーまたは第三者が被ったいかなる不利益または損害について，理由を問わず一切の責任を負わないものとします。
                        </li>
                    </ol>

                    <h2 className="mt-5">第9条（著作権）</h2>
                    <ol>
                        <li>
                            ユーザーは，自ら著作権等の必要な知的財産権を有するか，または必要な権利者の許諾を得た文章，画像や映像等の情報のみ，本サービスを利用し，投稿または編集することができるものとします。
                        </li>
                        <li>
                            ユーザーが本サービスを利用して投稿または編集した文章，画像，映像等の著作権については，当該ユーザーその他既存の権利者に留保されるものとします。ただし，運営チームは，本サービスを利用して投稿または編集された文章，画像，映像等を利用できるものとし，ユーザーは，この利用に関して，著作者人格権を行使しないものとします。
                        </li>
                        <li>
                            前項本文の定めるものを除き，本サービスおよび本サービスに関連する一切の情報についての著作権およびその他知的財産権はすべて運営チームまたは運営チームにその利用を許諾した権利者に帰属し，ユーザーは無断で複製，譲渡，貸与，翻訳，改変，転載，公衆送信（送信可能化を含みます。），伝送，配布，出版，営業使用等をしてはならないものとします。
                        </li>
                    </ol>

                    <h2 className="mt-5">第10条（利用制限および登録抹消）</h2>
                    <ol>
                        <li>
                            運営チームは，以下の場合には，事前の通知なく，投稿データを削除し，ユーザーに対して本サービスの全部もしくは一部の利用を制限しまたはユーザーとしての登録を抹消することができるものとします。
                            <ol>
                                <li>本規約のいずれかの条項に違反した場合</li>
                                <li>登録事項に虚偽の事実があることが判明した場合</li>
                                <li>
                                    破産，民事再生，会社更生または特別清算の手続開始決定等の申立がなされたとき
                                </li>
                                <li>1年間以上本サービスの利用がない場合</li>
                                <li>
                                    運営チームからの問い合わせその他の回答を求める連絡に対して30日間以上応答がない場合
                                </li>
                                <li>第2条第2項各号に該当する場合</li>
                                <li>
                                    その他，運営チームが本サービスの利用を適当でないと判断した場合
                                </li>
                            </ol>
                        </li>
                        <li>
                            前項各号のいずれかに該当した場合，ユーザーは，当然に運営チームに対する一切の債務について期限の利益を失い，その時点において負担する一切の債務を直ちに一括して弁済しなければなりません。
                        </li>
                        <li>
                            運営チームは，本条に基づき運営チームが行った行為によりユーザーに生じた損害について，一切の責任を負いません。
                        </li>
                    </ol>

                    <h2 className="mt-5">第11条（保証の否認および免責事項）</h2>
                    <ol>
                        <li>
                            運営チームは，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
                        </li>
                        <li>
                            運営チームは，本サービスに起因してユーザーに生じたあらゆる損害について一切の責任を負いません。ただし，本サービスに関する運営チームとユーザーとの間の契約（本規約を含みます。）が消費者契約法に定める消費者契約となる場合，この免責規定は適用されません。
                        </li>
                        <li>
                            前項ただし書に定める場合であっても，運営チームは，運営チームの過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害のうち特別な事情から生じた損害（運営チームまたはユーザーが損害発生につき予見し，または予見し得た場合を含みます。）について一切の責任を負いません。また，運営チームの過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害の賠償は，ユーザーから当該損害が発生した月に受領した利用料の額を上限とします。
                        </li>
                        <li>
                            運営チームは，本サービスに関して，ユーザーと他のユーザーまたは第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。
                        </li>
                    </ol>

                    <h2 className="mt-5">第12条（サービス内容の変更等）</h2>
                    <p>
                        運営チームは，ユーザーに通知することなく，本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし，これによってユーザーに生じた損害について一切の責任を負いません。
                    </p>

                    <h2 className="mt-5">第13条（利用規約の変更）</h2>
                    <p>
                        運営チームは，必要と判断した場合には，ユーザーに通知することなくいつでも本規約を変更することができるものとします。
                    </p>

                    <h2 className="mt-5">第14条（通知または連絡）</h2>
                    <p>
                        本サービスに関する利用者の運営チームへのご連絡・お問い合わせは、本サービスまたは運営チームが運営するwebサイト内の適宜の場所に設置するお問い合わせフォームからの送信、または運営チームが別途指定する方法により行うものとします。
                    </p>

                    <h2 className="mt-5">第15条（権利義務の譲渡の禁止）</h2>
                    <p>
                        ユーザーは，運営チームの書面による事前の承諾なく，利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し，または担保に供することはできません。
                    </p>

                    <h2 className="mt-5">第16条（準拠法・裁判管轄）</h2>
                    <ol>
                        <li>本規約の解釈にあたっては，日本法を準拠法とします。</li>
                        <li>
                            本サービスに関して紛争が生じた場合には，運営チームの本店所在地を管轄する裁判所を専属的合意管轄とします。
                        </li>
                    </ol>

                    <div className="d-flex flex-column align-items-end mt-5">
                        <p className="">
                            2018年12月19日 施行
                            <br />
                            <del>2018年12月19日 改定</del>
                        </p>
                        <p>以上</p>
                    </div>
                </div>
            </div>
        );
    }
}
